// 存放《四川菜谱》书中的详细做法
// 键：菜谱名称 (Name)
// 值：制作方法文本

window.RECIPE_METHODS = {
  "回锅肉": `1.选用二刀猪腿肉，洗净去毛，入汤锅内煮二十分钟，以煮至肉皮软时适宜；捞出稍晾，切成一分厚、一寸二宽、一寸五长、肥瘦相连的片。豆瓣、豆豉均剁成细茸。蒜苗多用蒜头部分，留少许青叶，洗净，切成一寸二长的段。
2. 炒锅内放入猪油烧至七成热，将肉片下入，炒至吐油时，将豆瓣、豆豉、甜酱、红酱油放入铲匀，再把蒜段加入焖熟，约三分钟即成。`,

  "鱼香肉片": `1.姜、蒜去皮，连同鱼辣椒分别剁成碎末，葱子切成细花。
2. 瘦肉切成长一寸二、宽八分的薄片，用料酒、水豆粉、盐与肉片拌和均匀。
3. 葱花、姜、蒜、鱼辣椒末、木耳、白糖、酱油、醋、水豆粉，加好汤少许，在碗内兑成鱼香滋汁。
4. 炒锅在旺火上烧红后，将油舀入锅内滗去，再换温油入锅，随将肉片倒下，用瓢子解散，即将鱼辣椒末倒下，把肉片煸起红色，即将兑好的滋汁倒入，急炒几下起锅。`,

  "小滑肉": `1.选肥瘦相连的猪肉，木耳洗净，鲜笋生的要煮熟，均切成指甲片，葱头选匀净的切成大葱花，姜、蒜改成碎末，泡辣椒切成鱼眼睛。
2. 肉片用水豆粉、盐、酱油、料酒拌和均匀，再用碗将白糖、醋、酱油、盐、料酒、豆粉及切好的葱花、木耳、清汤兑成滋汁。
3. 油在锅内烧至七成热，将码好的肉放入锅内炒散籽，即下笋子、泡辣椒、姜、蒜米，煸一下，烹入滋汁簸匀，盛入条盘即成。`,

  "干煸肉丝": `1.猪肉洗净，切成长一寸五的二粗丝；干辣椒、葱及鲜笋也切成二粗丝。
2. 油在锅内烧红，将辣椒放下，炸呈浅黄色捞起；再倒下肉丝，煸干水气后，加料酒、酱油、味精、盐，后加笋丝，继续煸，煸酥亮油，下辣椒、葱丝簸匀，搛入盘内即成。`,

  "陈皮肉": `1.选猪瘦肉洗净，切成六分见长的丁，用盐、料酒、姜片、葱段、酱油将肉丁拌和均匀，待二十分钟取出。
2.菜油在旺火上烧至九成热，将肉丁放入炸干水气捞起；干辣椒去籽切成五分长的节子；陈皮切成小条方块。
3. 菜油四两烧红，先将葱、姜煸一下，再加辣椒、花椒、陈皮、酱油、白糖、好汤，并将肉丁放入炒锅。不要炒至太干，有滋汁润气即起锅。将葱、姜拈去。吃时在辣椒中选肉丁。`,

  "锅巴肉片": `1.腰柳肉(背脊下面近猪腰处的肉)用刀片去白筋，横着肉纹切成长一寸半、宽八分的薄片(愈薄愈好)；用水豆粉、料酒、盐在碗内将肉片搅匀。玉兰片、青菌用刀片成长一寸二、宽八分的薄片。姜、蒜去皮，切成三分见方、半分厚的片。葱白斜切成六分长的段。清汤、白糖、醋、料酒、水豆粉、酱油、盐、味精等佐料在碗内调好。
2.猪油放入炒锅内在旺火上烧至八成热，将肉片倒入拨散，即加入姜、葱、蒜片及玉兰片、青菌等，翻搅一下，随将碗内调好的佐料倒入，用汤瓢搅匀，即炒成有汤的肉片。盛入碗内待用。
3. 锅巴取不厚不薄的，用手掰成长宽约两寸的块。菜油放入锅内在旺火上烧沸，将锅巴倒入，炸至呈金黄色时捞入盘中。盘底留沸油约六钱(淋肉片时发出声音才大)，然后将炒好的有汤肉片同时端出，待锅巴在桌上放定后，始将肉片往锅巴上淋下，这时“哗嚓”一声，盘中立即喷起一种浓烈的糖醋香味。`,

  "水煮肉片": `1.里脊肉放在菜墩上，横着肉纹切成长一寸、宽八分、厚半分的薄片，加上盐、料酒及蛋清豆粉，同时和匀。混合油放在锅内于旺火上烧至七成热，将花椒、干辣椒倒入炸成金红色，捞起剁成碎末，滗去炸油不用。白菜淘洗干净，切成比肉片稍大的碎块。姜去皮，切成二分见方的薄片。葱白切成八分长的段。
2. 混合油放在锅内于旺火上烧至刚冒烟时，将豆瓣放入炒酥，依次迅速地放入白菜、葱、姜、清汤、酱油、胡椒面、味精，用汤瓢稍一搅转，即用手将肉片抖散放入，随即用汤瓢搅动让它散开，煮约三分钟便熟，舀在碗中。
3. 将剁碎的干辣椒、花椒末撒在上面。再用汤瓢将混合油烧沸淋于面上。它的作用是：用沸油把干辣椒、花椒末、肉片再炸一下，使之有更浓的麻辣味。`,

  "旱蒸回锅肉": `1.猪肉去毛，刮洗干净。于沸水中微煮，除去血腥味，取出，切成三条界方块。加盐、醪糟浮子，拌和均匀后加葱、姜，上笼旱蒸，至七八成，晾冷待切。
2.青蒜洗净，切为六至七分长的节；豆瓣剁细；蒸好的肉切成二分厚、一寸二宽、一寸五长、肥瘦相连的片。
3. 旺火，热油浪匀。将肉片下锅，贴至微黄色吐油时，把多余的油滗去部分，陆续下豆瓣、甜酱、青蒜合炒，最后放酱油簸匀起锅。`,

  "芙蓉肉片": `1.鸡蛋清一个，与冷清汤同放碗中，用竹筷搅打均匀，上笼蒸熟为白芙蓉，愈嫩愈好(如蒸过火成蜂窝状即老了)。另将鸡蛋清二个加干豆粉和成蛋清豆粉。葱切细花，姜、蒜均切成碎米。
2. 猪肉选用夹心肉半斤(即前腿贴着扇形骨的肉，纤维无横顺之分，最嫩)，原有厚度约八分，先切成一寸二宽的块，再横着切成半分厚的片，即成为一寸二长、八分宽、约二分厚的薄片，共切三十片。将肉片放入碗中，加胡椒面、盐、味精、料酒，一同拌匀渍十分钟，使之入味。然后将蛋清豆粉倒入，翻搅合匀，使全部蘸裹在肉片上。
3. 将锅用旺火烧热，使全锅温度均匀，放入猪油，即端离火口，左右上下转动，使油均匀涂于锅内(以免贴肉片时焦煳粘锅)。然后将肉片伸展开，在其一面蘸上面包粉(将面包揉搓成为粉)贴于锅上。待全部贴好后持锅于旺火上，左右来回移动烘烤，注意使受热面均匀，不要烤煳。约烘一分钟，肉片着锅面呈金黄色，能随锅活动起来时，即将另锅烧至冒大烟的猪油约四两(要先准备好)倒入，并把锅端起摆动一下，让油淌到贴在锅边的肉片上约二秒钟(经沸油浪后，未着锅的一面肉，由半熟而烫熟，吃起来更嫩)，滗去油，摆入盘中。
4. 用旺火将锅烧至冒烟，放入猪油，加葱花、姜、蒜米稍熵一下，烹入料酒，随即放入兑好的酱油、醋、白糖、水豆粉、味精、清汤，再用汤瓢推搅几下，烧沸后淋在盘中肉片上。然后将白芙蓉从笼中取出，用调羹分五下舀在淋好汁的肉片上即成。`,

  "萝卜连锅": `1.选猪腿肥瘦二刀肉，去毛，刮洗干净。锅内的清水以把肉淹过为准(一次加足，不要再添)，在旺火上烧沸，再放入猪肉，至再沸时用汤瓢打去浮沫(在制作过程中要随时打去浮沫)。随即加入花椒十粒，并把姜拍松放入，用木盖盖好。煮十分钟左右，用削尖的竹筷从肉皮上往下插，略微用力，一穿即透便够火候。然后捞出晾一下，等热度稍降低不太烫手时，按肉纹横切成两块。把肉块放在菜墩上，片成三寸长的薄片，愈薄愈好。
2. 萝卜去皮，洗净，切成约一寸五长、一寸宽、三分厚的片，连同葱白放入煮肉汤中煮六七分钟。至萝卜片刚，即将肉片倒入锅中搅匀，与萝卜片同煮二三分钟。待萝卜粑透时加入味精，即成“连锅”。(烹制中随时注意把锅盖好。)
3. 花椒十粒，与干辣椒一同放入锅中，在微火上用手铲不停翻炒，至辣椒刚炒酥时滴入菜油少许炒匀，铲起砸成辣椒面，用大汤杯盛起。将菜油烧热，等温度降低一半时倒入辣椒面中，随即加入豆瓣、酱油、味精等，调匀为料碟(料碟可备一二碟，或每人一碟)与连锅一同上席。`,

  "粉蒸肉": `1.选用肥膘猪肉，用温水洗净，刮去茸毛，切成三寸长、一分半厚、一寸二宽的肉片。
2. 花椒、葱叶混合剁成细末，与红酱油、酱油、醪糟、豆腐乳水、红糖、大米粉一两四钱，二汤，连同切好的肉片放入深碗内一起调拌均匀。然后将拌好配料的肉片逐片鱼鳞式地平铺于蒸碗内，有皮部分靠近碗底，瘦肉在上面，两旁再用肉片一片片地镶装整齐。
3. 豌豆淘洗干净，加盐、米粉(六钱)，放入拌猪肉以后的碗內拌匀，再放于肉片上面入笼蒸三小时；吃时翻扣在盘内即成。`,

  "咸烧白": `1. 猪肉选用猪肋条接近腹部一块的五花肉，用温水洗净，刮尽肉皮毛茸。芽菜淘洗，去渣，切细，与豆豉混合拌匀。泡辣椒去籽，切成段待用。
2.锅内放菜油少许，烧热，将油浪匀。猪肉抹上咸红酱油，稍浸，即放入锅中烙烫，至皮微皱、酱油颜色已入肉皮时取出，切成二寸半长、一寸二宽、二分厚的片，共二十四片。把肉片每六片为一组镶成卍字形，铺于碗底，上面加甜红酱油，放上泡辣椒，再将拌匀的芽菜倒上，入笼蒸二小时即成。吃时翻扣于盘内。`,

  "夹沙肉": `1.选用猪肥膘肉，洗净，去茸毛。入锅内煮熟，捞出，趁热在皮面上色。切成二寸半长、一寸半宽、二分厚的片子十六片。再把每片肉的二分之一处横片一刀，至肉皮处，不要把肉皮片断。
2. 炒锅内放红糖，炒至溶化时，加洗沙、猪油六钱半，共炒均匀，约五分钟铲入碗内；加入玫瑰捣匀，分为十六份；然后于片好的肉片破口处逐一塞入炒好的玫瑰糖洗沙一份，压成扁形，再逐片摆在蒸碗內成圆形。
3. 糯米淘洗后在水中先泡三十分钟，再用净布包好，入笼蒸二十分钟取出，在清水中浸一次，再入笼蒸二十分钟，以蒸烂为适宜。取出加红糖一两九钱、猪油六分半，拌匀，放在蒸碗的肉片上，入笼蒸二小时。吃时翻扣于盘中，上面加白糖即成。`,

  "龙眼咸烧白": `1.连皮五花肉一方，拈尽残毛，刮洗干净。在锅内煮至五成熟，捞起，用布抹干油气，在皮面上抹红酱油少许上色。锅内用菜油少许，烧沸浪匀，在旺火上将五花肉爆起，至褐红色时捞起。用刀片成长五寸、宽一寸二、厚一分的薄片，共二十四片。鱼辣椒切成二十四节，芽菜擦手切成细节。
2. 每片裹入鱼辣椒一节，豆豉一至二颗，裹成卷筒形，立装入蒸碗内，再放入红酱油、盐、芽菜等，上笼蒸一小时半至时，取出翻入盘内。`,

  "龙眼甜烧白": `1.干沙、红糖在锅内熬化，炒成洗沙待用。
2. 连皮肥肉先入煮锅内煮二十分钟(刚熟未为度)，捞起晾冷，切成长三寸、宽五分、厚一分的片二十片，每片裹入洗沙成卷，向着有皮的一面按上一个樱桃在中间，卷成二十个圆卷筒，有樱桃的挨于碗底，用二鱼碗装好。
3. 酒米淘洗后在水中泡三十分钟，用净布垫好上笼蒸二十分钟取出，用清水浸一次，再上笼蒸二十分钟，至成酒米饭。红糖溶化拌匀，装入定好烧白的二鱼碗内作底，再上蒸笼蒸三十分钟至粑，出菜时洒上白糖即成。`,

  "荷叶蒸肉": `1.将大米、花椒、大料面等一并放入锅中，在微火上炒成黄色，再用小石磨磨成米粉。
2.取连皮的猪肥肉和净瘦肉各半斤，刮洗干净，拈净残毛。肥肉切成一寸半长、一寸宽、一分二厚的片；瘦肉切成厚一分，长、宽与肥肉相等的片，各切二十片。另将红、白酱油、料酒、甜酱、醪糟、红糖、豆腐乳水、葱、姜末等一并放入盆内拌匀，将肥瘦肉片放入，调拌后腌十余分钟，使之入味；再将米粉放入拌匀(如太干可加少许清水)，使米粉沾在肉片上。青豆(即嫩黄豆，嫩时为青色)用清水洗净。
3. 将鲜荷叶用清水洗净，入开水里烫一下，使它柔软不易折断；然后切成四寸长的等边三角形共二十张，取肥肉片一片放在叶内，再放入青豆五六粒，上面摆上瘦肉一片包好，一共包成二十个，摆入盘内上笼蒸三小时即熟，取出即可食用。`,

  "大南瓜蒸肉": `1.先将南瓜去皮，洗净，再将南瓜切盖挖心，掏尽内瓤。
2. 五花肉洗净，切成二寸长、一分厚的片。把姜、葱、花椒宰细，同醪糟浮子、酱油、豆腐乳水、甜酱、红糖、香料面和切好的肉片拌匀，再拌入米粉子，装入南瓜内，盖上南瓜盖子。
3. 在大蒸碗内大火蒸约二小时。走菜时取出，揭去南瓜盖子，滑入大盘内即成。`,

  "芙蓉杂烩": `1. 炸酥、放响、汆笋子、抠鸡松、剁圆子馅。
2.酥肉、肚、舌、火腿、响皮、笋子、鸡松，分别切、片成一寸五长、三至四分宽条片，圆子刮成尖刀。
3.碗底用火腿、肚、舌各一片摆好，两头各摆鸡松一片，碗周围按酥肉、火腿、肚、舌、鸡松各一片间隔镶满，再按先后放圆子、响皮、笋子分层垫底加姜葱、料酒上笼；芙蓉蛋单蒸。走菜时吃味、灌汤，芙蓉蛋舀在周围。`,

  "奶汤大杂烩": `1.锅内倒入菜油一斤半烧热，将猪肉皮放入，约五分钟炸软，连锅提起，移放微火上再浸五分钟，至色为深牙黄色时捞起晾冷，切成一寸长的条块，漂于清水中待用(俗称响皮)。
2. 干笋洗净，用水浸泡，胀透为度；再每条用手撕成四条，切成二寸的段。然后入沸水中煮透，去净硫磺质味，再用清汤汆一次，捞出待用。
3. 选用肥膘猪肉二两，洗净去皮，切成二寸长、四分宽的片。鸡蛋(二个)、干豆粉(五钱)混合调为蛋清豆粉，加盐(二分)与肉片拌匀。锅内菜油烧红，把拌好的肉片放入炸五分钟，至炸成深牙黄色时捞出，晾冷待用(俗称酥肉)。
4.选用肥瘦相连的猪肉二两，洗净去皮，剁为肉茸，加干豆粉(二钱)、鸡蛋(一个去壳)、盐(三分)混合调匀，拨一部分摊于左手上面(平摊约四分厚、一寸半宽)，右手持刀斜刮左手的肉茸为上大下小的三角条形(俗称鲫鱼背)共十六条，分开摆于盘内，入笼蒸十分钟后取出晾冷待用(图1俗称尖刀圆子)。
5.熟猪心、猪舌均切成一寸半长的薄片。
6. 鸡蛋一个，去壳搅散。炒锅烧热，锅中擦净，稍用菜油涂匀，将蛋倾入，以手提耳锅转动，即摊成蛋皮，稍冷，蛋皮即自行脱落。把肥瘦相连的猪肉二两洗净，剁成细茸，加入水豆粉、盐、胡椒，调匀后铺于贴锅一面的蛋皮上，两端向中央搓裹，成为两卷，中间相连，接口处涂少许豆粉粘好。然后平放盘内入笼蒸十五分钟，取出晾冷，用刀稍斜横切成一寸半宽的小块(俗称如意蛋卷)。
7.用平底大碗一个，先将永好的笋条、响皮摆在碗底；次将酥肉逐片摆成圆形，为第二层；又将尖刀圆子十六条分为每方四条摆成卍字形，为第三层；再将猪心、猪舌像铺瓦一样分别各摆半个碗，成圆形，为第四层；最后将蛋卷用刀平铲放于上面。再用火腿，把特级奶汤、味精、料酒灌入摆好的杂烩碗内，入笼蒸二小时取出。再用特级奶汤十两，加味精、盐，舀入杂烩内。另选绿色鲜菜一束，淘洗烫熟，放入碗内以衬其色即成。`,

  "松子肉": `1.选用肥瘦相连的猪肉，洗净，切成二寸长、一分半厚的细丝。松子去皮捶茸放于肉丝中。萝卜去皮，切成二分厚、二寸长的粗丝，挤干水。姜、葱均切成细丝。
2. 鸡蛋去壳与干豆粉调匀成为蛋清豆粉，加入味精、盐、胡椒，于深碗中混合好，再与猪肉丝、萝卜丝、姜、葱一并拌匀。
3.豆油皮一张修成六寸宽、八寸长，平铺案板上，而后把拌匀的猪肉丝、萝卜丝等铺在豆油皮上，铺成七分厚，铺上豆油皮的一半，再把另一半叠过来，接头处涂蛋清豆粉封口。
4.炒锅倒入菜油烧红，将叠好的豆油皮包放入炸透，炸成金黄色，滗去炸油，放盘中晾冷。再用刀切成一寸半长、三分宽、七分厚的长条，共二十四条。以六条为一组，于碗中镶成卍字形。然后加二汤淹没肉条，上笼蒸三十分钟取出，扣于碗内，再加奶汤四两、盐七分即成。`,

  "晾干肉": `1.大头菜削皮，横切成极薄的半圆形片，葱、蒜去皮，蒜切片，葱切马耳朵待用。
2.选猪后腿净瘦肉一斤，不拘规格，用平刀片成极薄的肉片，贴于筲箕背，将肉铺开晾起，肉面洒上酱油、胡椒面、料酒等，待两三小时后水气已晾干。
3.将菜油烧开，倒入干肉片炸黄，铲于墩子上，切成一寸大小的姜糖块(即旗子块)。
4. 化猪油二两入锅烧热，即投入葱、姜、蒜、醋、白糖、清汤、香油，勾二流芡成汁，最后将炕酥的肉片、大头菜倒入，一烹即成。`,

  "麻圆肉": `1.割去保肋瘦肉，铲去肉皮，成猪肥膘。先在汤锅内煮透心(已熟)捞起，切成四分见方的颗，再入沸水内汆一次，去其浮油，捞起晾干水气，即在连蛋黄的蛋豆粉内裹上一层，即成待用的肉圆。
2. 菜油烧至八成火，将肉圆入油锅炸至浅黄色捞起。油滗尽后，在锅内放入白糖及少许清水，炒至糖汁起大泡时加入芝麻，即倒入炸过的肉圆，边炒边将锅几颠，使肉圆裹糖起锅。敞风，糖即干，盛盘。`,

  "鹅黄肉": `1.鸡蛋三个调匀，先在锅内摊成蛋皮二张。肥瘦肉剁成细末，加料酒、葱花、姜米、酱油、盐、味精、豆粉、胡椒面、鸡蛋一个，共拌匀成馅。
2.蛋皮铺开全抹上蛋清豆粉，将拌好的馅裹成六条蛋卷，用手拍成宽六分、厚二分的扁形卷，用刀在卷的半面切成丝，半面不切(如切蜇卷样)，然后再按一寸距离切为三十段。
3. 菜油烧至八成火，将切过的蛋卷入油锅内炸熟，捞起盛入盘内。
4. 锅内留适当的油，再放鱼香味作料，勾成二流芡滋汁，淋上即成。`,

  "松花肉": `1.蛋黄调散，蛋清快速调成蛋泡。面粉过箩筛，同味精、盐慢慢加入蛋泡内，用筷子轻轻调匀待用。
2. 猪肉、冬笋、口蘑，分别用刀剁碎。锅内放猪油少许，将猪肉调匀，依次加入蛋黄、冬笋、口蘑、料酒及葱花、酱油、白糖、五香面等，炒熟成馅子，起锅待用。
3.炒锅置于文火上，将猪油烧至三成热，把调好的蛋泡倒入一半，煎成圆形、直径约六寸的蛋饼。将炒熟的馅子，倒于蛋饼中心，立即将另一半蛋泡盖于馅子上，并按上鲜豆尖。同时另用一锅将全部猪油烧沸，再慢慢舀淋入锅内的蛋泡上。油舀完约五分钟，滗去油，搛入盘内即成。`,

  "南卤肉": `1.选五花肉，切成长一寸五、厚三分的骨牌片。葱切成两寸长的节。姜洗净，刮皮，拍破，对剖。
2.油在锅内烧至七成热。将肉熵干水气，加入盐、白糖、料酒、葱、姜，然后烹入清水。在旺火上烧开后，打净泡沫，加豆腐乳汁，移至文火上煒至肉，拈去姜渣，盛入白瓷条盘。`,

  "双色肉糕": `1. 猪肉剁成肉茸；鸡蛋破壳，蛋清、蛋黄分开搅散(不起泡)；葱、姜切成细末。
2. 肉茸加蛋清、盐、花椒面、姜、葱、豆粉、味精，拌匀成馅。
3. 平底瓷盘，盘底抹油，四方框上木板高一寸，过心四寸。先倒入蛋清，上笼蒸三分钟至熟。即将拌好的馅倒在蛋清上面，用手抹平，倒上蛋黄抹平再上笼蒸透。取出启去底板晾冷，切成大骨牌片，长一寸二。用二鱼碗定成三叠水或风车式，加汤一两，再上笼蒸透，取出翻入盘内。
4. 锅内的油烧热掺汤下锅，加盐、味精、料酒，勾芡扯成白汁，淋上肉糕即成。`,

  "芙蓉肉糕": `1.肥膘肉煮熟，切成长一寸五的二粗丝，下沸水锅汆过(去油)，用漏瓢滤起，在盘内晾干水气，再将蛋清豆粉与肉丝调拌均匀。
2.将肉丝用手拌散，撒入七成火候的油锅，随即用漏瓢打起。撕散，再入八成火候的油锅，炸脆，起锅待用。
3. 将红糖熬起泡时加青糖，将肉丝倒入。随手将锅提起来造转，再倒进搪瓷方盘。用铲或刀按平约七分厚，面上撒一层胭脂糖(白糖用色素调成)。晾冷后切成姜糖块(即斜方块)，装入条盘。`,

  "焦皮肘子": `1.将肘子残毛拈去，放在炭火上烧，至皮呈焦黑时，丢入热水内泡半点钟，至皮已软后，取出，用刀全部刮去烧黑的一层，现出黄色时，入清水清洗两次待用。
2. 鼎锅置于旺火上，放入碎骨垫底，加汤，再投入肘子。汤一冲开，打净血泡，即端离旺火放在小火上煒起。
3. 油在炒锅内用旺火烧热，下冰糖炒成汁，舀入少许鼎锅内的汤把糖汁冲散。加料酒、酱油、葱(挽成结)、姜(拍破)、盐，用汤瓢荡匀翻入鼎锅。继续煒两小时，用筷子将肘子拈入大圆盘摆好。滋汁滗入炒锅内，加味精，勾芡，收酽后淋在肘子上即成。`,

  "烧皱皮肉": `1.将猪肉残毛拈去，刮洗干净。入汤锅，除尽血水。煮熟捞起，用布抹干油气，在皮面上抹红酱油少许上色。葱切成长节，姜拍破待用。
2. 用铝锅一个，把洗净的鸡(或骨)放入垫底，取其鲜味，且避免巴锅，上面铺放炸好的猪肉，必须猪皮向上。随即用炒锅炒好冰糖汁，烹入清汤并加料酒、盐、香料、葱、姜，浪转后倒入铝锅。在微火上烧至六成时，将猪肉翻面，肉皮即向下了，继续以微火烧。此时汤已收酽，把滋汁滗入碗内，即将肉翻入圆盘，拣去垫底的骨头及姜、葱，然后淋上滋汁即成。`,

  "芝麻肘子": `1.肘子在炉火上将粗皮一层烧成焦色的皱纹状时，泡在温水内刮洗干净，在沸水内除去焦味，捡去泡沫。用铝锅一个，先在内面垫上一层猪骨或鸡、鸭骨，再将肘子放在骨上(皮朝下)，掺入全部清汤、料酒、姜、葱、盐及三分之一的冰糖炒的糖汁。在中火上烧至五成时，再投入余下的冰糖，继续烧至全为止。
2. 芝麻淘洗后，去壳炒熟，用杆杖碾一下。白糖、食色兑成胭脂糖，连芝麻造匀。走菜时先将烧粑的肘子拈入盘中放好，将原汁烧浓淋上面，即将造合过的芝麻撒在肘子上即成。`,

  "罐烧肉": `1.猪肉拈尽残毛，刮洗干净，入沸水锅内煮十分钟，除去血水，捞起晾干水气。冰糖炒成金黄色的糖汁。
2.油在锅内烧红，将猪肉放入，使猪皮向下，不断用汤瓢舀炸油浇淋，炸成淡黄色捞起。
3.取用包罐(或铝锅)，垫上鸡骨(鸡足、翅、篾巴均可)，将肉皮向上放入包罐，加酱油、葱、姜、料酒、花椒、盐、糖汁、冰糖，二汤淹过猪肉两寸，在武火上烧沸后改用文火烧至七成时，将猪肉翻面继续烧炽盛入盘内，再将收浓的滋汁滗起淋上即成。`,

  "红枣煨肘": `1.猪肘拈尽毛桩，刮洗干净，在煮锅内除去血腥味。红枣洗干净。
2. 小铝锅一个，先在底上垫几块细瓷瓦片，掺水二斤，将肘子放入，在旺火上烧开，打去泡沫。将冰糖炒成深黄色糖汁倒下，连同其余冰糖、红枣在锅内烧一小时，再移文火上慢煨二小时。待肘子煨至、烂、粘稠，汁酽即起锅。`,

  "南煎圆子": `1. 菜心淘净，沮好；茨菰削皮；香菌洗净泥沙。
2. 猪肉切成小豌豆大的丁，火腿、兰片、香菌、茨菰，分别切成细丁；葱切细花；姜去皮切细末。以上各材料加盐、酱油、水豆粉、鸡蛋(连黄)搅匀，共做成四个肉圆子，略按扁。
3. 油烧至七成热，肉圆煎成金黄色，捞起入碗，加姜、葱，搭汤上笼，蒸炬。
4.走菜时将圆子拈在盘内摆好，菜心用原汁加料酒、胡椒、盐、味精、酱油，吃味后镶在菜的周围，余汁用水豆粉扯成滋汁，加香油淋上即成。`,

  "苕菜狮子头": `1.金钩用清水发胀，茨菰去皮，肥瘦肉、火腿、鲜青豆等分别切成碎颗，鸡蛋清与豆粉调成蛋清豆粉，同时盛入碗内，再放入盐、料酒、胡椒、味精等，用手拌匀，按四分之一捏成四个扁形的圆子，放入锅内(锅内有猪油)，炸进皮时，不见黄色即捞起。
2.用小包罐一个洗净，将捞起的圆子放下，加入清汤、姜、葱及剩余全部作料，放在文火上烧二时。烧至半熟时将淘洗干净的苕菜放入，继续烧至熟透为止。走菜时用深圆盘先将四个圆子摆成四方形，将苕菜镶于四周围，将罐內的原汁灌入呈半汤形，淋入鸡油即成。`,

  "软炸蒸肉": `1. 猪肉刮洗干净，切成两寸长、一分半厚的片，装在大碗内。将花椒、五香粉、酱油、豆腐乳水、醪糟、白糖、姜米、葱花、盐、料酒在碗内兑好调匀。豌豆洗净。面包揉成细粉。鸡蛋打破搅匀。盐、花椒合成椒盐。
2.将兑好的调料倒在肉片碗内造匀，码二十分钟，再加米粉、豌豆，拌匀后，将肉片摆入洗净的二鱼碗底成一封书形，面上装豌豆，上笼蒸粑，取出翻在另外的二鱼碗，拈出肉片晾冷，豌豆仍上笼馏起。
3. 晾冷的蒸肉两面抹上搅好的鸡蛋，再挨个地两面沾满面包粉，下入八成热的油锅内，炸呈金黄色捞起，装在条盘中心。
4. 将豌豆取出，装在蒸肉条盘的一端，另端镶椒盐及白糖两味即成。`,

  "软炸子盖": `1.选五花猪肉一方，放入汤锅内煮三分钟，去净血水泡沫，捞出晾冷，去皮，切二分厚的片，盛入大碗中，加料酒，红、白酱油，再把老姜拍松，葱切段拌匀，平放于大平盘中，上笼蒸一点半钟，出笼滗去汁水，晾冷待用。
2. 鸡蛋清和干豆粉一起拌匀。甜酱和香油一起拌匀。蒜切成片。葱白洗净，切成一寸长的段。
3. 锅放炉上烧红，将菜油放入烧至七成热，用净布一方在开水中浸湿，拧干水后，将五花肉片上的油擦干净。用竹筷将肉片一片片地夹起，裹满蛋清豆粉，放入油锅内炸。炸至黄色、酥皮时起锅，淋香油，然后用刀切成斜方块，摆入条盘的一端。另一端摆蒜片、甜酱、葱白段入席。`,

  "炸扳指": `1.选用体厚质佳的肥肠头三段，靠近肛门部份切去一圈不用，在清水中加入白矾末，把肥肠放入，用力揉搓清洗一次，除去粘液涎水；另换清水加盐，同样揉搓清洗两次。即把肠的里面(有油的一面)翻出来，用刀撕去油上粘的杂质脏物(注意不要撕掉油)，再继续用水清洗。这样两面反复多洗几次，直到肥肠白净涩手，无臭味为止。最后仍把有油的一面翻到內面去，洗净后放在开水锅内煮一刻钟捞出。再把肠两端用刀修去一分左右，使之整齐。每段再分别切成两段(共六段)。用大蒸碗盛起，放入清水、盐、葱白三段、料酒、花椒、姜等佐料，使水淹没过肥肠，上笼用旺火蒸三小时，至肥肠起着皱褶为适合。
2.葱白用刀切成一寸长段，两头切成细花翻起。甜酱用香油、白糖拌合调匀。大蒜去皮，切成四分见方、半分厚的片。生菜洗净，用香油、醋少许、蛋黄、白糖、咖喱拌合(炸扳指时才拌)。葱、姜、大蒜分别用刀切成细末，和香油、料酒、清汤、水豆粉、白糖、醋、酱油等佐料，用碗盛好调匀，成为糖醋汁。
3. 菜油倒入炒锅内烧沸，将蒸好的肥肠取出(要炸时才取，葱、姜等不要)，放在盘内将水滗干，顺着锅边放入锅内，并立即用汤瓢将肠拨横过来，不使两头肠口向着人(因为肠内有水，刚一下锅要炸几下，溅起来的油容易烫伤人)。炸时要用汤瓢拨动肥肠，以便炸匀。约五分钟，肠呈金红色，即把油滗去，淋上香油，颠两下即捞出。然后在案板上用刀把肥肠切成四分厚的圆圈，堆在盘的中间，盘的两端分别放上拌好的生菜和葱酱蒜。再在炸扳指的原锅内将糖醋汁煎热，盛在两个汤杯内，与扳指一同上桌。`,

  "软炸肚头": `1.猪肚头洗净去筋，切成一寸二分长、八分宽、三分厚的块，每块上面划上距离一分半宽的斜十字花刀，漂于清水中。葱切成葱节，蒜切成片，与料酒、盐同放碗内，将肚花滤干水放入，浸约五分钟后捞去姜葱不用，以净布揩干水气，把鸡蛋清与豆粉混合入碗，将肚花拌匀。
2. 炒锅内放入猪油烧沸，投入肚花微炸，约三分钟以漏瓢捞入盘中，把它分散开，不要几块结成一团。此时锅内炸油较前为烫，再将肚花放入，炸至稍带黄色，约四分钟滗去炸油，加入香油，簸匀起锅，盛入盘中。
3. 以花椒末与盐拌匀盛入小碟，汤杯内放入醋加数滴香油拌匀，吃时分别蘸用。`,

  "软炸腰卷": `1.选用色白的猪腰，片成两半，去净腰臊，再片成整张薄片，顺切成细丝。猪肉选肥瘦相连者，片成薄片，切成细丝，长度与腰丝相等。水发玉兰片去老根用嫩笋尖，片成薄片，横切成细丝。猪网油切成六寸长、二寸宽的片张。葱去叶、去须、洗净，只用白头，切成一寸二分长的段。
2. 鸡蛋清二个，加干豆粉，拌为蛋清豆粉待用。将鸡蛋一个去壳，放入大碗中，加干豆粉拌匀；再将腰丝、猪肉丝、笋丝放入，加料酒、胡椒面、盐等一起拌匀。
3. 将猪网油铺入大净盘中，用手指粘蛋清豆粉均匀地抹于网油上，再将拌好的腰丝、肉丝等取一部分放于网油上，摆成一字形，裹成长六寸、直径六分大的圆卷共二条，再将卷的两头用蛋清豆粉粘稳，以免炸时漏馅。将余下的干豆粉倒在菜板上，擀细铺平，放上腰卷，让它粘满细豆粉。
4. 锅放炉上，放入菜油烧红，再放入蘸上干豆粉的腰卷，炸成牙黄色起锅，横切成六分长的段，摆于条盘的一端；另一端摆甜酱(甜酱中加香油搅匀)、葱白段、蒜片。将余下的香油淋于腰卷上，另用两个三寸碟子盛椒盐(盐与花椒面拌匀)一起上席。`,

  "锅贴腰片": `1. 猪肥膘煮熟，晾冷去皮，修整齐；火腿切细末；韭菜只用白头子，切为磉礅节子；调蛋清豆粉。
2. 修好的肥膘片成一寸二宽、一寸五长、一分厚的薄片；猪腰的片法稍小于肥膘，各为二十四片。猪腰用白酱油、料酒、姜葱先调拌均匀入味。用净布把猪肥膘的油揩去，一面涂抹蛋清豆粉后放火腿末少许，再把腰片揩干水份放上面与肥膘粘拢。
3.中火。用猪油浪匀炙锅。逐一把二十四个粘好的腰片贴于锅内炕起，火不大不小，慢慢使肥膘的油浸出部分，肥膘逐渐炕黄，腰片随之至熟即起锅，镶生菜入席。`,

  "清汤腰方": `1.猪腰每个对剖成两片，去油皮和腰臊，每片剞成斜纹花刀，边沿修整齐，根据猪腰大小切二至三刀成正方片，用清水洗净，在沸水烫三火，入清水内漂冷。
2. 锅内加清汤烧沸，捞起漂冷的腰方片，滤干水份，入汤中再烫五成火，捞入走菜碗内；清汤扫一次，加青叶菜少许，用盐、胡椒、味精、酱油吃好味灌入碗内即成。`,

  "兰花肚丝": `1. 用刀先将肚头的油筋片干净，平刀起成两层，斜刀剞成花子，再切成二粗丝，用水豆粉加盐、胡椒面、料酒码匀。
2. 茨菰削皮，切成二粗丝；兰草花抽芯，去茎，淘洗干净。分别漂入清水内。
3.清汤、水豆粉，加其余的盐、料酒、味精，兑成滋汁。
4.旺火。先将锅内猪油烧至五成热时，即将肚丝放下，急速滑散，拨在一边，下兰花、茨菰，稍造一下再合匀，烹下滋汁，将锅簸匀，淋香油起锅即成。`,

  "葱末肝片": `1.将猪肝横切成薄片，愈薄愈好，片张宜大；加酱油拌匀，渍半分钟，再放入水豆粉混和均匀。
2.将净锅在旺火上烧至冒青烟端离火口，将菜油舀入浪一下倒出。再将猪油放入，重将锅置于旺火上，烧至冒大烟时，把肝片放入锅中，用汤瓢前后左右迅速轻轻推动，并翻动数下，再推至锅边，将锅斜放。随即加入葱末，煸炒几下。烹入临时兑好的醋、白糖、胡椒面、味精、水豆粉、料酒、清汤等调料。到滋汁烧沸时，推下肝片，翻炒两下，放入红酱油，即将锅端起颠簸几下，使调味均匀，火候一致即成。`,

  "白油猪肝": `1.木耳泡胀，去沙，择足；鱼辣椒摘把，去籽，切马耳朵；小白菜择洗，留心；姜蒜去皮，切小方片；葱切七八分长的节。
2. 猪肝去筋缠，边沿体薄处用片刀，体厚处用切刀；切片时都要薄，越薄越好，要大张不烂。
3.盐、咸红酱油、料酒、胡椒、水豆粉、汤少许，兑成滋汁；猪肝用水豆粉调拌均匀。
4.炒锅在旺火上烧红后，将油舀入，浪匀滗去；另换油，烧至五六成下肝片，用瓢子推出括进。炒散后，下木耳等小副料，炒转后，烹滋汁，从锅边下，几簸起锅，捻花椒面。`,

  "煳辣腰块": `1.将猪腰选好片成两块，去腰臊，用刀在腰的里面立划深约腰厚的三分之二的十字花刀，然后切成长一寸、宽八分的块，与料酒、盐及水豆粉拌匀；白糖、醋、酱油、味精、清汤及水豆粉二钱同盛一碗中兑成滋汁；辣椒切成马耳朵形的段；姜、蒜切薄片；葱切六分长的段。
2.油下锅，在旺火上烧到八成火候时，放进辣椒段，炒成黑红色时，加入花椒，放下腰块、葱、姜、蒜、快速炒散，随即沿着锅边倾下已兑好的滋汁，迅速翻炒，颠簸起锅。`,

  "肥肠豆沙汤": `1.取下肥肠的中段(不粗不细)四段，将盐在肥肠上用力揉搓，再于清水中淘洗干净，除去粘液涎水。再换清水洗一次，把肥肠有油的一面翻出来，撕扯掉油上粘的杂质脏物(不要撕掉油)。这样反复清洗几次，洗至肠白，涩手，无臭味为止；再把有油的一面翻到内面去。肥肠洗净后在开水锅内煮约一刻钟捞出，用刀修去两头约一分厚，装入大蒸碗内，加葱白、花椒、料酒、盐、姜等佐料和清水四两(以没过肥肠为度)，上笼蒸约三小时，至肠皮起皱褶为合适。
2. 干豌豆用温水泡十二小时(水要没过豌豆一寸)，即泡胀，然后倒入竹筲箕内滤去水。随后把苏打放入豌豆内抄匀，倒在锅内加水，放在微火上烧，煒两小时，豌豆已至极烂，即倒入筲箕内，把水滤干，倒入木瓢内(舀水的瓢)，然后双手持漏瓢在豌豆上用力压，边压边移，豌豆泥就由漏瓢孔内冒出，透不过孔的，即为豌豆壳不用。
3. 猪油放入炒锅内，于旺火上烧至七成热，即将豆泥炒翻沙，加入盐及鸡汤，用汤瓢背将豆沙按散。开锅后撇去浮沫，随后将笼内的肥肠取出，切成四分长的段，倒入锅内同煮。开锅后撇去浮油，舀入放好味精的碗內即成(碗内再放少许葱末、姜汁水亦可)。`,

  "竹荪肝膏汤": `1. 竹荪用温水泡十分钟，洗净、去脚、去净杂质，用刀横切成六分长的段，用清水漂着待用。
2. 猪肝去筋，用刀背捶成极细的浆，盛入大碗中，加入冷透的清汤拌匀，用稀眼净布滤去肝渣不用；再将老姜、大葱拍松，放入肝汁中，加鸡蛋二个、盐、胡椒面、味精，用竹筷搅匀；再去掉姜、葱，倒入蒸碗中，上笼用旺火蒸十五分钟，汁即变成肝膏。
3.锅放炉上，放入清汤，再加盐、胡椒、味精。将汤烧开，然后将竹荪由泡水中捞出，在二汤中汆一二次，放入汤中，随即起锅放入碗中。再将蒸好的肝膏出笼，轻轻地把整块肝膏倒入汤碗中上席。`,

  "菠饺白肺": `1.选择较白净无破洞的猪肺一副(可先检查，看是否有漏气的地方)，用绳将肺把子拴住，肺叶向下挂起，用大铁壶盛清水(有自来水的就用自来水龙头)慢慢由肺上端管口灌入冲洗，待肺内水满膨胀，即用双手轻轻捧起肺叶向上倾倒一次血水。灌时若遇血块阻塞停滞，可用一比肺管口略细、长约七寸的竹管插入肺管内用手轻拍，使之畅通再灌(但不能用力过大，不然肺易破裂，裂后就不能洗白了)。这样反复灌洗，到肺内红色血水全部随水漫出，猪肺全部变为白色为止。冲洗净后，把肺叶向上肺管向下用竹筲箕装起，将水滤干，再照原来方法把肺挂起，滤净水，入沸水锅中煮熟，切成长一寸二分、宽一寸、厚半分的片。
2. 猪肉去筋，在菜墩上用刀剁成细泥，加入香油、盐、冷清汤在碗内拌合成馅。火腿、鸡皮切成一寸二分长、八分宽的片待用。
3. 菠菜淘洗干净，去茎留叶，在木瓢内用手搓揉成菜泥，用纱布包好挤出绿色菜汁，和入干面粉内拌匀(汁不够时可略加清水)用力揉成面团；再平均扯成二十四个小面剂，用小面棍擀成圆形饺皮。把拌好的馅分摊在饺皮上对折包成半圆形，饺边用手捏成细褶，然后用清水把饺子煮好，端离火口，用时再捞出。
4. 猪油放在炒锅内，于旺火上烧热，放入姜、葱白、料酒和清汤，开锅后用漏瓢将姜、葱捞出不用，放入盐、胡椒面、味精，同时捞起锅内的水饺倒入汤锅内，再加入口蘑、火腿、鸡皮、白肺片，至汤再开后淋入鸡油倒入大菜盘内即成。`,

  "菠饺玻璃肚": `1.选新鲜猪肚，只取肚头部分，清洗干净；用刀将两面的筋缠及边沿修去，成长方形，随着形式用刀将肚头片成极薄的片(越薄越好)。片的要求：要薄、要匀、要不片烂。
2. 用清水少许将草碱溶化于肚片上造匀，在盆内浸渍半小时后，用沸水冲入盖严；烫焖十分钟揭盖，即将碱水滗去，另换清水；每隔五分钟换一次，如是换四次，直到将碱味去掉为止。此时肚片则变为细嫩、柔软、半透明，如玻璃体状。
3. 瘦肉用刀背砸茸，先用一两剔尽筋缠，加入酱油、料酒、香油及味精、胡椒面、盐各少许拌成馅。菠菜淘洗干净，用手揉烂，挤水，拌干面粉，调匀，揉成绿色子面，擀成圆形饺皮二十四张，将馅包入成半圆形的“成都水饺”式样，用沸水煮熟打起，与肚片在大碗内对镶好。
4. 清汤在锅内烧沸，用肉茸分两次在锅内扫成白清汤，加味精、胡椒面、盐注入碗内即成。`,

  "四上玻璃肚": `1.选新鲜猪肚，只取肚头部分，清洗干净；用刀将两面的筋缠及边沿修去，成长方形，随着形式用刀将肚头片成极薄的片(越薄越好)。片的要求：要薄、要匀、要不片烂。
2. 用清水少许将草碱溶化于肚片上造匀，在盆内浸渍半小时后，用沸水冲入盖严；烫焖十分钟揭盖，即将碱水滗去，另换清水；每隔五分钟换一次，如是换四次，直到将碱味去掉为止。此时肚片则变为细嫩、柔软、半透明，如玻璃体状。
3. 箩粉用刀切成大姜糖块形(即大斜方形)，用盐、香油少许拌过；番茄先用沸水烫后，撕皮去蒂，片成薄片。
4. 葱叶、花椒加盐少许，在菜墩上用刀共同铡成细末，加白酱油、香油及红酱油各少许，兑成椒麻调料；白酱油、香油及清汤少许，兑成白油调料；熟油辣椒，加白糖、香油、白酱油、醋少许，兑成红油调料；生姜去皮，切成姜米，加醋、白酱油、香油少许，兑成姜汁调料。以上四种调料分别盛入四个汤杯。
5. 走菜时肚片在开水内冒后，滤干水份放入大盘中间，周围镶以番茄片、箩粉片，相互间隔摆好，连同四个调料汤杯，随菜上席。`,

  "龙眼脊髓": `1. 脊髓撕去皮筋，入沸水加盐煮开，打尽血泡，至熟捞起；鱼肉、猪肥膘分别捶成茸，与蛋清、豆粉、盐，搅成鱼糁；猪瘦肉捶成茸；火腿切成二分宽、半分厚的片。
2. 脊髓分别盘装在二十个抹有猪油的小酒杯内，再把火腿片嵌在中心，用手微按一下，使火腿片边子陷入脊髓，抹上蛋清豆粉，上面装入鱼糁，上笼蒸十分钟取出，挨个放入另一蒸碗內卜脊髓向上，火腿向下，再上笼蒸十分钟，取出用汤过一道翻入大碗。
3. 用肉茸清汤；加料酒、酱油、盐，临起锅时加味精、胡椒，舀入脊髓内即成。`,

  "红烧环喉": `1.将环喉撕去油筋，再将内层翻出，放于墩子上，用刀尖依次成蜈蚣的爪形，切成一寸五的段，放入碗内，加清汤入笼，大火蒸一小时半。又将火腿、兰片、鸡松切成一寸二长、五分宽的片，放于盘内待用。
2.将锅放于旺火上，倒入化猪油，烧至六成火候，将葱、姜投入油锅，稍炸，打去不用，再投入火腿、鸡松、兰片，又将笼内的环喉取出投入锅内，加入料酒、胡椒、味精、酱油、盐，炒动数转，再放入清汤，烧三分钟，勾入水豆粉起锅，淋入鸡油，再入盘内即成。`,

  "生烧筋尾舌": `1.猪舌用开水煮约十分钟，刮净舌上粗皮，舌根切除不用，然后切成长一寸半、宽五分、厚一分半的片；猪尾去毛、去垢，用刀刮洗洁白，切成一寸半长的段；鲜猪蹄筋爪清水洗净，去掉蹄筋前边的瘦肉，亦切成一寸半长的段。
2. 炒锅用旺火烧红，放入猪油，倾入切好的猪舌、猪尾、蹄筋，同时放入姜葱炒动；到炒尽水份时加料酒、冰糖汁、盐和二汤；再烧至沸时，撇去汤面的浮沫，倒在砂锅内以微火煨煮二小时，拈去姜葱，倒在盘内；将青菜心洗净捞起，镶于盘角，以衬其色(不用青菜亦可)。`,

  "豆渣猪头": `1.猪头一个(不要猪耳)，先用夹子夹去猪毛，凹缝中的毛可用铁钎烧红烙去(注意所有毛必须去净)。随后再用小刀刮洗，剔去骨头，去净肉中一切骨渣。再用清水刮洗，直到洗净。然后将锅放在炉上，倒入清水十斤，将猪头肉和猪头骨一起放入，用旺火煮五分钟后捞出，再用清水全部刮洗干净待用。
2. 豆渣放蒸碗中，上蒸笼蒸二十分钟，出笼晾冷，用净布包着挤干水。锅放炉上烧红，倒入猪油烧开，再放入豆渣，用微火炒五分钟。炒时注意常用汤瓢拨刮锅心，以免豆渣巴锅。炒至油和豆渣合为一体时，再加猪油四两，继续用微火炒五分钟，然后加猪油二两，继续用微火炒，要炒酥炒香，炒至豆渣不吐油，再吐油时滗去余油，起锅待用。
3.姜、葱洗净，用刀把姜拍松，用稀眼净布把姜、大葱、花椒、胡椒、八角、草果包好待用。
4. 用大面砂锅一个，将清汤、料酒、醪糟、冰糖汁、盐、酱油、姜、葱布包一起放入，再放入猪头骨，随后将猪头肉放在头骨之上，用旺火烧开，然后将锅口用草纸封后继续用旺火烧四小时左右，扯去草纸，捞出猪头肉盛入大圆盘中，再将砂锅中的原汁倒入锅中熬酽，然后放入炒好的豆渣与味精拌匀，淋于猪头肉之上入席。`,

  "坛子肉": `1.海参用温水泡十六小时，洗净泥沙，挖去肠脏，切成长一寸、宽六分的条方块；用二汤汆二次，用清水漂冷心，再用净布一方包好。鱼翅用温水泡十分钟，洗净上面的胶水，去净子骨和杂质，放入大碗中，加清水一斤半，上笼蒸一小时，出笼滗去水，再用二汤汆一次，用清水漂冷心，用稀眼净布一方包好。珧柱用温水泡十分钟，洗净后用稀眼净布包好。口蘑用温水泡五分钟，洗净泥沙，去净根和杂质，用稀眼净布包好。大金钩洗净。墨鱼用温水泡半小时，去净骨和杂质，将每条撕成两半。猪骨洗净。猪肘子肉去净茸毛，刮洗干净，切成四大块。肥母鸡宰杀、去毛、去肠脏，切成两半，每半再切成两块。肥瘦火腿刮洗干净，切成一寸二长、六分宽的条块。冬笋去壳，去老根，取用嫩尖部分，切成一寸二长、六分宽的条块。肥鸭宰杀，去毛、去脏，洗净后切成两半，每半再切成两块。
2.锅中倒入清水十斤，放入鸡蛋，用旺火烧开，再将猪骨、猪肘子、鸡肉、鸭肉等放入锅中煮五分钟。随后全部捞出，放入清水中漂冷心，洗净肉上泡沫，将猪骨、猪肘子、鸡肉、鸭肉盛入碗中待用。煮熟的鸡蛋去壳，漂入清水中；再把锅中水倒去，放入猪油烧红，将去壳鸡蛋由水中捞起，滤去水分，放入干豆粉，裹满豆粉，放入油中炸成深黄色，捞出待用。
3. 姜洗净拍松。大葱去须洗净。用稀眼净布一方把姜、大葱、胡椒等包好待用。
4. 准备干锯末二十斤。在平整干燥的地坪上，安上铁质三脚架(高五寸)。架内倒上锯末五斤，架底处的锯末留一空窝，内放烧红的杠炭三段(每段长约五寸)，再把大口料酒坛(内外有釉、无裂缝者)一个安于三脚架上。然后将猪骨垫于坛底和坛内四周，再将开水、料酒、姜、葱布包、盐、红白酱油、火腿、猪肘子肉、鸡肉、鸭肉、冬笋、口蘑布包、墨鱼、珧柱、大金钩、冰糖汁等依次放入坛中。用纸封固坛口，再把锯末十五斤堆于坛外四周，煨四五小时(在煨的过程中，要有专人负责看火，不能用旺火，也不能断火)后，撕去坛口草纸，将鱼翅布包，海参布包，炸好的鸡蛋放入坛中，再煨半小时即成。
5.此菜吃法有两种：一种是将各种肉分开，分别装盘上席；另一种是将各种肉分小，镶盘上席。此菜一般适于冬季制作，一次吃不完，可以分几次吃。上述配料可供二十人吃一餐。`,

  "烤酥方": `1.选料及处理选厚膘连皮带肋骨肉一方，横、长一尺，宽九寸。肉皮须平整没有凸凹者。先去净茸毛，刮洗干净。然后肉皮向下、排骨向上放于案板上，用直径二分粗的尖长竹签，在排骨缝中瘦肉上刺上若干气眼。刺的深度以接近肉皮为合适，但不要把肉皮刺破。然后将它揩干水份，用铁质二股烤叉一把，由排骨之下，肥肉之上的瘦肉中又进去，又尖伸出肉方外约一尺左右。
2. 出坯用干柴十斤，先用二斤放炉内烧燃，炉中火苗燎出炉口一尺至二尺(须经常保持这种火苗，火苗不均匀时加柴)，随即手拿叉柄，将肉方的皮向着火苗，排骨向上(不要着火)在火苗上燎。一面调剂火候，一面手拿叉柄左右拧动。拧动的角度是：先把肉方拧至肉皮与地平成八十五度后，再拧过去成同样的角度。这样反复来回拧动。拧动的速度是：中间稍稍快，两端稍停。着重燎肉方的四周和四角，燎至肉皮上的毛眼中好像在沸腾。同时猪皮上比较粗老的皮被烤成一层很薄的黑壳，自行整张地脱落于炉火中(若有的地方没有落，就说明那里的火候还不够)，然后将肉方挪开炉火，用净布擦净又尖，取下放入烫水中，用布帕洗净。通过出坯，肉皮比原肉皮薄，保留的肉皮约半分厚，皮上微微现出蜂窝形状的花纹，带牙黄色，本道工序即成。待本菜上席前二十分钟再进行烤酥的工序。
3.烤酥 用青砖二十四块，在平坦的地坪上嵌一烤池，用细煤渣灰五斤平铺在烤池底，将杠炭八斤烧红，平放(不要立放，立放便要伸出火苗，烤酥时严忌火苗)在烤池之中。再将肉方由原叉眼中叉好，放于烤池上，肉皮向火，排骨向上，同样手拿叉柄左右拧动。拧动的角度与出坯相同，但速度稍快。烤至肉方出油时，将烤池内的红杠炭捡于烤池四周(前后两端多放一些，去净池心的火星，以免肉方的油滴于火上，引起火苗)，继续拧动着烤。此时肉方皮上的油很多，为了使它在肉皮上流来流去，把皮烫酥，而不掉下来，故拧动速度宜再快些。烤至肉皮成金黄色时，可以用刀尖试验一下是否酥泡。试法是：用手指捏着刀叶，只留一分长的刀尖在外，将肉方拿离烤池，用刀尖在肉皮上连锥几下，如发出酥泡的响声为合格。然后将香油三钱刷于酥皮之上，用净布擦净又尖，取下酥方，酥皮向上放于大圆盘中。
4. 铲皮上席用刀尖在酥皮下平铲，将铲下的酥皮切成一寸半长、七分宽的条方片，照原样摆于肉方之上。另外，给每位顾客配汤盃一个，内盛加味特级清汤(二两)；三寸手碟一个，内盛蒜片、甜酱(甜酱中加香油二钱搅匀)、葱白段(一寸半长)三段；再配五寸平盘一个，内盛点心两块，连同酥方一同上席。
5.吃法 一般只吃酥方皮，不吃肉。肉可用来做回锅肉，别有风味。`,

  "叉烧奶猪": `1.饲养与宰杀：将乳猪买回，用稀饭喂养三四天，以去其腹内污秽和长膘。杀时用尖刀从咽喉处杀死，倒提后足流去血浆。再用干细炭灰匀撒猪身以手抹匀，以六至七成开的热水烫洗去毛，从头至尾用镊子(头部凹缝处可用烧红的铁钎烙)清洗干净。然后从喉头起将猪逢中对半剖开，去肚腹内脏，留腰子不取。
2. 盘足：将两前足屈起，从挨近颈下裙边处(用尖刀在两边各挖一个孔)塞入腹腔。另用筷子两支，削成竹钉，分别穿过猪蹄前端，以防烤时滑出腹外；后足亦如前法盘入腹腔，用筷子穿好。
3. 出坯：在热水中将猪皮烫伸，取出用干净布抹干水气，再以红酱油将皮抹成黄红色。此时从杀口处取出颈骨一节(约一寸长)，再由腹腔内将脊椎与肋骨接榫处(俗呼龙骨)从中切剖约二寸长，以便上又时猪身平伏不致突起。
4.上叉：将叉子(铁制、两股)从猪后腿近肘处刺入猪身，穿过腹腔，在一二匹肋骨缝中刺进猪肉层，再从猪头两耳根下穿出(此时尖约与猪眼平行)；将两耳边用刀修去一部分，使之直立略呈尖形；将尾巴用竹签穿过，扭成乙形，尾尖向上略微倾向猪头。用尖头竹签，从肚腹两边裙边处刺进猪肉，以不伤皮为度。在肋缝处可以斜刺，大约每匹肋骨刺三下即可，作用是避免烧烤时猪身皮面起泡。注意切勿将猪皮刺伤。
5. 烧烤：先砌砖池一个，长二尺五、宽二尺、高六寸五，池底垫细炭灰一层约五分厚。
6. 烤头：将杠炭烧红，置于砖池中央，将猪头向下，腹向池外，用火烤至头顶，烤到脸泡成淡黄色，耳朵烤干为止。
7. 吊膛：将杠炭火勾平散开，把叉子头、尖，平放在砖池上。此时猪腹向下，烤至水气吊干，以手触之无水份，不粘手为度。此时再将杠炭勾至砖池周围，中间不留炭火，杠炭分布在叉柄叉尖两端占三分之二(即放猪头、尾处)，两侧三分之一。烤时猪背向下，腹向上。在往两侧翻动时，起初角度应稍大，至翻到裙边肉处。到裙边微带黄色时，角度渐小，直到只翻烤背部。烤至全身火色均匀，均呈黄色时，再周身滚转烤，至烤成深琥珀色为止，用筷子敲一下清脆作ト卜声。(翻烤时手要稳，火要匀，并密切注意如发生起泡现象，必须立即将又离开砖池，用竹签由腹腔內距起泡不远处刺进以泄其气。如任其爆烈则吃时顶牙，影响质量。)
烤好后，将杠炭散开铺满砖池，将猪身抹上香油，在火上翻滚烤约四五遍离池。将又尖用布搽净，用手扶住猪身后肘将叉取出。
将烤好的猪放在干净案板上，用尖刀将猪皮划成长方形骨牌片。划时先从头至尾划直线，后划横线。再用小刀启松，使皮、肉相离，但仍保持原形。随配点心二盘(荷叶饼、烧饼均可)，连同葱酱碟上席。
此菜一般食皮弃肉，亦有将腰子、耳朵、尾巴、脑花、水肉(即皮下之肉)另切一盘上席者谓之“小件头”，吃法与上同。`,

  "怪味鸡": `1.取肥阉鸡腿，放入汤锅中加清水，将鸡腿淹没，先用旺火煮沸，再将汤锅挪到微火上煮约二十分钟(在煨煮过程中水都要把鸡腿淹没，水不够时可加煮沸的汤)即熟。然后捞起晾冷，去骨，砍成五分宽、七分长的斜象眼块(即斜方块)。用盘一个，盘中心先将葱白丁放入，再将砍好的鸡块摆在上面，状如松果纹。
2. 芝麻用清水淘洗，去净空壳、沙石，滤干水；放入锅中置微火上，以手铲不停翻炒，炒至发出“啪啪”的声音，呈金黄色(注意不要炒)时即铲入碗内。然后取用五钱放在缽内，砸成粉，加香油调匀，成为芝麻酱。
3.将芝麻酱、酱油、白糖、醋、辣椒油、花椒面等一并放入碗内调匀后，淋在摆好的鸡块上；然后撒上余下的芝麻一钱即成。`,

  "棒棒鸡丝": `1.生鸡肉(选料以仔鸡为宜)在汤锅内煮熟后捞起(不能煮)，晾冷，用刀去骨，切成长二寸粗丝。葱白剖开切成与鸡一样的丝子在盘内垫底，鸡丝铺在上面。
2. 酱油、白糖、香油、芝麻酱、花椒面、醋、熟油辣椒在碗内调匀，走桌时始将作料倒下，不宜过早。`,

  "豆芽拌鸡丝": `1. 豆芽淘洗干净，掐去两头。
2. 鸡肉切二粗丝，根条均匀。
3. 绿豆芽用沸水永一下，立即捞起，造点毛毛盐，晾开晾冷，放入盘中作底。鸡丝放面上，酱油、辣椒油、蒜泥、醋、白糖、味精等用碗调匀，淋于鸡丝面上即成。`,

  "自拌鸡丝": `1.将鸡皮扯下，鸡骨剔尽，皮及肉分别切成二粗丝，鸡丝放入蓝色圆盘，鸡皮堆在上面。
2. 葱头切成丝，窝油、酱油、醋、花椒面、蒜泥、白糖、味精、香油、芝麻酱、油辣椒、芥末等分别盛入十二个碟子。
3. 走菜时鸡丝及调料碟齐上，由客人自己调拌食用。`
};
